<a href="https://colab.research.google.com/github/lejaaprianza/Belajar-Pandas-Python/blob/main/Pandas_tutorial_dari_Indonesia_Belajar.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas 01 | Menyertakan Prefix dan Suffix pada seluruh Kolom Pandas Data Frame | Python Pandas

In [ ]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.5
1.19.5

In [ ]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)), columns = cols)

df

   A  B  C  D  E
0  4  4  9  1  4
1  4  7  1  3  3
2  9  5  4  5  2
3  2  8  5  2  9
4  1  1  8  8  9

In [ ]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [ ]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        4        4        9        1        4
1        4        7        1        3        3
2        9        5        4        5        2
3        2        8        5        2        9
4        1        1        8        8        9

In [ ]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        4        4        9        1        4
1        4        7        1        3        3
2        9        5        4        5        2
3        2        8        5        2        9
4        1        1        8        8        9

#Pandas 02 | Pemilihan baris (rows selection) pada Data Frame | Python Pandas | Data Science

In [ ]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5,size=(n_rows,n_cols)), columns = cols)

df

   A  B  C  D  E
0  3  3  2  4  1
1  4  1  4  4  3
2  1  2  4  3  2
3  2  3  2  2  3
4  1  3  3  4  1
5  3  4  4  4  1
6  4  3  2  2  2
7  3  2  1  4  1
8  2  1  1  4  1
9  3  4  1  3  2

In [ ]:
df[(df['A']==1)|(df['A']==3)]

   A  B  C  D  E
0  3  3  2  4  1
2  1  2  4  3  2
4  1  3  3  4  1
5  3  4  4  4  1
7  3  2  1  4  1
9  3  4  1  3  2

In [ ]:
df[df['A'].isin([4,5,1])]

   A  B  C  D  E
1  4  1  4  4  3
2  1  2  4  3  2
4  1  3  3  4  1
6  4  3  2  2  2

In [ ]:
df[~df['A'].isin([4])]

   A  B  C  D  E
0  3  3  2  4  1
2  1  2  4  3  2
3  2  3  2  2  3
4  1  3  3  4  1
5  3  4  4  4  1
7  3  2  1  4  1
8  2  1  1  4  1
9  3  4  1  3  2

#Pandas 03 | Konversi tipe data String ke Numerik pada kolom Data Frame | Python Pandas

##**Persiapan Data Frame**

In [ ]:
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [ ]:
df.dtypes

col1    object
col2    object
dtype: object

##**Konversi tipe data dengan fungsi astype()**

In [ ]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [ ]:
df_x.dtypes

col1    object
col2     int64
dtype: object

##**Konversi tipe data numerik dengan fungsi to_numeric()**

In [ ]:
df.apply(pd.to_numeric,errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

#Pandas 04 | Pemilihan kolom (columns selection) pada Pandas Data Frame berdasarkan tipe data

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.5
1.19.5

##**Persiapan** **DataFrame**

In [2]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']
df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns = cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_rows,freq='H')

df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         10.0          3    A
1 2000-01-01 01:00:00          1.0         14    B
2 2000-01-01 02:00:00          5.0         10    C
3 2000-01-01 03:00:00          2.0          4    D
4 2000-01-01 04:00:00         17.0         17    E

In [3]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int64
teks                   object
dtype: object

##**Memilih kolom bertipe data numerik**

In [4]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         10.0          3
1          1.0         14
2          5.0         10
3          2.0          4
4         17.0         17

In [5]:
df.select_dtypes(include='float')

   bil_pecahan
0         10.0
1          1.0
2          5.0
3          2.0
4         17.0

In [6]:
df.select_dtypes(include='int')

   bil_bulat
0          3
1         14
2         10
3          4
4         17

##**Memilih kolom bertipe data string atau object**

In [7]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

##**Memilih kolom bertipe data datetime**

In [8]:
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

##**Memilih kolom dengan kombinasi tipe data**

In [11]:
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0         10.0          3    A
1          1.0         14    B
2          5.0         10    C
3          2.0          4    D
4         17.0         17    E